Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: Regardless of the wire type, both GMAW and FCAW operate under a 'Constant Voltage' (CV) power source, a pivotal characteristic for achieving consistent weld quality. Some welding machines might label this as 'CP' (Constant Potential). It's crucial to understand that 'potential' here essentially refers to 'voltage.' Being aware of this terminological nuance ensures clarity when selecting or adjusting equipment settings. In summation, FCAW, with its flux-filled wires, offers a unique welding approach, balancing the convenience of equipment shared with GMAW and the adaptability of flux shielding. Whether opting for self-shielded or dual shield, understanding the intricacies of FCAW is crucial for obtaining optimal weld quality. As with any welding process, mastering FCAW requires both theoretical knowledge and hands-on practice.
es_419: Independientemente del tipo de alambre, tanto GMAW como FCAW operan bajo una fuente de energía de 'voltaje constante' (CV), una característica fundamental para lograr una calidad de soldadura constante. Algunas máquinas de soldar pueden etiquetarlo como "CP" (potencial constante). Es fundamental comprender que aquí "potencial" se refiere esencialmente a "voltaje". Ser consciente de este matiz terminológico garantiza claridad a la hora de seleccionar o ajustar la configuración del equipo. En resumen, FCAW, con sus alambres llenos de fundente, ofrece un enfoque de soldadura único, que equilibra la conveniencia del equipo compartido con GMAW y la adaptabilidad del blindaje de fundente. Ya sea que se opte por un blindaje doble o autoprotegido, comprender las complejidades de FCAW es crucial para obtener una calidad de soldadura óptima. Como ocurre con cualquier proceso de soldadura, dominar FCAW requiere tanto conocimientos teóricos como práctica.
fil_ph: Anuman ang uri ng wire, parehong gumagana ang GMAW at FCAW sa ilalim ng isang 'Constant Voltage' (CV) power source, isang mahalagang katangian para sa pagkamit ng pare-parehong kalidad ng weld. Maaaring lagyan ng label ito ng ilang welding machine bilang 'CP' (Constant Potential). Napakahalagang maunawaan na ang 'potensyal' dito ay mahalagang tumutukoy sa 'boltahe.' Ang pagkakaroon ng kamalayan sa terminolohikal na nuance na ito ay nagsisiguro ng kalinawan kapag pumipili o nag-aayos ng mga setting ng kagamitan. Sa kabuuan, ang FCAW, kasama ang mga flux-filled na wire nito, ay nag-aalok ng kakaibang welding approach, na binabalanse ang kaginhawahan ng kagamitan na ibinabahagi sa GMAW at ang adaptability ng flux shielding. Kung pumipili man para sa self-shielded o dual shield, ang pag-unawa sa mga intricacies ng FCAW ay mahalaga para sa pagkuha ng pinakamainam na kalidad ng weld. Tulad ng anumang proseso ng welding, ang pag-master ng FCAW ay nangangailangan ng parehong teoretikal na kaalaman at hands-on na kasanayan.
ht: Kèlkeswa kalite fil la, tou de GMAW ak FCAW opere anba yon sous pouvwa 'Vòltaj Konstan' (CV), yon karakteristik esansyèl pou reyalize bon jan kalite soude ki konsistan. Gen kèk machin soude ta ka make sa a kòm 'CP' (Potansyèl Konstan). Li enpòtan pou w konprann ke 'potansyèl' isit la esansyèlman refere a 'vòltaj'. Lè w okouran de nuans tèminoloji sa a asire klè lè w ap chwazi oswa ajiste anviwònman ekipman yo. An rezime, FCAW, ak fil kouran plen li yo, ofri yon apwòch soude inik, balanse konvenyans nan ekipman pataje ak GMAW ak adaptabilite nan pwoteksyon koule. Si w ap chwazi yon pwoteksyon pwòp tèt ou oswa yon plak pwotèj doub, konprann sibtilite FCAW yo enpòtan anpil pou jwenn pi bon kalite soude. Menm jan ak nenpòt pwosesis soude, metrize FCAW mande tou de konesans teyorik ak pratik pratik.
pt_br: Independentemente do tipo de fio, tanto o GMAW quanto o FCAW operam sob uma fonte de energia de “Tensão Constante” (CV), uma característica essencial para alcançar uma qualidade de solda consistente. Algumas máquinas de solda podem rotular isso como 'CP' (Potencial Constante). É crucial compreender que “potencial” aqui se refere essencialmente a “tensão”. Estar ciente desta nuance terminológica garante clareza ao selecionar ou ajustar as configurações do equipamento. Em suma, o FCAW, com seus fios cheios de fluxo, oferece uma abordagem de soldagem única, equilibrando a conveniência do equipamento compartilhado com o GMAW e a adaptabilidade da blindagem de fluxo. Seja optando por blindagem autoprotegida ou dupla, compreender os meandros do FCAW é crucial para obter a qualidade ideal da solda. Como acontece com qualquer processo de soldagem, dominar o FCAW requer conhecimento teórico e prática.
zh_hans: 无论焊丝类型如何，GMAW 和 FCAW 都在“恒压”(CV) 电源下工作，这是实现一致焊接质量的关键特性。某些焊机可能会将其标记为“CP”（恒定电位）。理解这里的“电势”本质上指的是“电压”是至关重要的。了解这一术语的细微差别可确保选择或调整设备设置时的清晰度。 总之，FCAW 及其填充焊丝提供了一种独特的焊接方法，平衡了与 GMAW 共享设备的便利性和焊剂屏蔽的适应性。无论选择自保护还是双保护，了解 FCAW 的复杂性对于获得最佳焊接质量至关重要。与任何焊接工艺一样，掌握 FCAW 需要理论知识和实践实践。

source: SMAW machines are diverse, available in configurations like A/C (Alternating Current), D/C (Direct Current), and the combined A/C D/C. For those striving for code quality welding, D/C remains the gold standard, chiefly due to its stable arc that doesn't face the periodic extinguishing seen in A/C. Notably, while many electrodes are versatile enough for either polarity or current type, Direct Current Reverse Polarity (DCRP) is predominantly preferred. The reason? DCRP concentrates more heat at the electrode, while Direct Current Straight Polarity (DCSP) directs it more towards the workpiece. A/C, on the other hand, is a potent remedy for arc blow issues, though it's not a panacea for operator-induced inefficiencies. One of SMAW's commendable attributes is its adaptability to out-of-position welding, thanks to electrodes specially crafted for the task. A proficient welder isn't merely defined by their practical skills but also by their intimate knowledge of their equipment. This entails discerning the intricacies of their machine, including the setup for the desired polarity. For instance, many might overlook the fact that an A/C-only machine lacks a polarity switch – a seemingly small detail that can make a significant difference in welding outcomes. Furthermore, understanding how to accurately gauge amperages and discern the machine's duty cycle – its operational time in a given period without overheating – is vital.
es_419: Las máquinas SMAW son diversas y están disponibles en configuraciones como A/C (corriente alterna), D/C (corriente continua) y A/C D/C combinado. Para aquellos que se esfuerzan por lograr una soldadura con calidad de código, el D/C sigue siendo el estándar de oro, principalmente debido a su arco estable que no enfrenta la extinción periódica que se observa en el A/C. En particular, si bien muchos electrodos son lo suficientemente versátiles para la polaridad o el tipo de corriente, se prefiere predominantemente la polaridad inversa de corriente directa (DCRP). ¿La razón? DCRP concentra más calor en el electrodo, mientras que la polaridad recta de corriente directa (DCSP) lo dirige más hacia la pieza de trabajo. El aire acondicionado, por otro lado, es un remedio potente para los problemas de arco, aunque no es una panacea para las ineficiencias inducidas por el operador. Uno de los atributos encomiables de SMAW es su adaptabilidad a la soldadura fuera de posición, gracias a los electrodos especialmente diseñados para la tarea. Un soldador competente no se define simplemente por sus habilidades prácticas sino también por su profundo conocimiento de su equipo. Esto implica discernir las complejidades de su máquina, incluida la configuración para la polaridad deseada. Por ejemplo, muchos podrían pasar por alto el hecho de que una máquina que solo funciona con aire acondicionado carece de un interruptor de polaridad, un detalle aparentemente pequeño que puede marcar una diferencia significativa en los resultados de la soldadura. Además, es vital comprender cómo medir con precisión los amperajes y discernir el ciclo de trabajo de la máquina (su tiempo operativo en un período determinado sin sobrecalentamiento).
fil_ph: Magkakaiba ang mga SMAW machine, available sa mga configuration tulad ng A/C (Alternating Current), D/C (Direct Current), at ang pinagsamang A/C D/C. Para sa mga nagsusumikap para sa welding ng kalidad ng code, ang D/C ay nananatiling gold standard, pangunahin dahil sa matatag nitong arko na hindi humaharap sa panaka-nakang pagpatay na nakikita sa A/C. Kapansin-pansin, habang maraming mga electrodes ay sapat na maraming nalalaman para sa alinman sa polarity o kasalukuyang uri, ang Direct Current Reverse Polarity (DCRP) ay higit na ginustong. Ang dahilan? Ang DCRP ay nag-concentrate ng higit na init sa electrode, habang ang Direct Current Straight Polarity (DCSP) ay higit na nagdidirekta nito patungo sa workpiece. Ang A/C, sa kabilang banda, ay isang mabisang lunas para sa mga isyu sa arc blow, kahit na hindi ito isang panlunas sa lahat para sa mga inefficiencies na dulot ng operator. Ang isa sa mga kapuri-puring katangian ng SMAW ay ang kakayahang umangkop nito sa wala sa posisyong hinang, salamat sa mga electrodes na espesyal na ginawa para sa gawain. Ang isang mahusay na welder ay hindi lamang tinutukoy ng kanilang mga praktikal na kasanayan kundi pati na rin ng kanilang matalik na kaalaman sa kanilang kagamitan. Nangangailangan ito ng pagkilala sa mga intricacies ng kanilang makina, kabilang ang pag-setup para sa nais na polarity. Halimbawa, marami ang maaaring makaligtaan ang katotohanan na ang isang A/C-only na makina ay walang polarity switch - isang tila maliit na detalye na maaaring gumawa ng malaking pagkakaiba sa mga resulta ng welding. Higit pa rito, ang pag-unawa kung paano tumpak na masukat ang mga amperage at matukoy ang duty cycle ng makina - ang oras ng pagpapatakbo nito sa isang partikular na panahon nang walang overheating - ay mahalaga.
ht: Machin SMAW yo divès, disponib nan konfigirasyon tankou A/C (Altènatif Kouran), D/C (Kourant Dirèk), ak konbine A/C D/C. Pou moun ki fè efò pou soude bon jan kalite kòd, D/C rete estanda lò a, sitou akòz arc ki estab li yo ki pa fè fas a etenn peryodik yo wè nan A/C. Miyò, pandan ke anpil elektwòd yo versatile ase pou swa polarite oswa kalite aktyèl, Direct Current Reverse Polarity (DCRP) se sitou pi pito. Rezon an? DCRP konsantre plis chalè nan elektwòd la, pandan y ap Direct Current Straight Polarity (DCSP) dirije li plis nan direksyon pou pyès la. A/C, nan lòt men an, se yon remèd ki pisan pou pwoblèm souflèt arc, menm si li pa yon mirak pou inefikasite operatè-pwovoke. Youn nan atribi louabl SMAW a se adaptabilite li nan soude andeyò pozisyon, gras a elektwòd ki fèt espesyalman pou travay la. Yon soudeur konpetan pa senpleman defini pa ladrès pratik yo, men tou pa konesans entim yo nan ekipman yo. Sa a mande pou konprann sibtilite yo nan machin yo, ki gen ladan konfigirasyon an pou polarite a vle. Pou egzanp, anpil moun ta ka neglije lefèt ke yon machin A / C-sèlman manke yon switch polarite - yon ti detay w pèdi ki ka fè yon diferans enpòtan nan rezilta soude. Anplis de sa, konprann ki jan yo byen mezire anperaj ak disène sik devwa machin nan - tan operasyonèl li nan yon peryòd bay san yo pa surchof - enpòtan anpil.
pt_br: As máquinas SMAW são diversas, disponíveis em configurações como A/C (Corrente Alternada), D/C (Corrente Contínua) e o combinado A/C D/C. Para aqueles que buscam soldagem com qualidade de código, o D/C continua sendo o padrão ouro, principalmente devido ao seu arco estável que não enfrenta a extinção periódica vista no A/C. Notavelmente, embora muitos eletrodos sejam versáteis o suficiente para polaridade ou tipo de corrente, a polaridade reversa de corrente contínua (DCRP) é predominantemente preferida. A razão? DCRP concentra mais calor no eletrodo, enquanto Direct Current Straight Polarity (DCSP) o direciona mais para a peça de trabalho. O ar condicionado, por outro lado, é um remédio potente para problemas de arco elétrico, embora não seja uma panacéia para ineficiências induzidas pelo operador. Um dos atributos louváveis ​​do SMAW é a sua adaptabilidade à soldagem fora de posição, graças aos eletrodos especialmente elaborados para a tarefa. Um soldador proficiente não é definido apenas por suas habilidades práticas, mas também por seu profundo conhecimento de seu equipamento. Isto implica discernir as complexidades da sua máquina, incluindo a configuração para a polaridade desejada. Por exemplo, muitos podem ignorar o facto de que uma máquina apenas com ar condicionado não possui um interruptor de polaridade – um detalhe aparentemente pequeno que pode fazer uma diferença significativa nos resultados da soldadura. Além disso, é vital compreender como medir com precisão a amperagem e discernir o ciclo de trabalho da máquina – seu tempo operacional em um determinado período sem superaquecimento.
zh_hans: SMAW 机器多种多样，有 A/C（交流）、D/C（直流）和组合 A/C D/C 等配置。对于那些追求规范质量焊接的人来说，D/C 仍然是黄金标准，主要是因为它的电弧稳定，不会遇到 A/C 中出现的周期性熄灭的情况。值得注意的是，虽然许多电极对于极性或电流类型都足够通用，但直流反极性 (DCRP) 是主要首选。原因？ DCRP 将更多热量集中在电极上，而直流直极性 (DCSP) 将更多热量引导至工件。另一方面，空调是解决电弧偏吹问题的有效补救措施，尽管它并不是解决操作员引起的效率低下的灵丹妙药。 SMAW 值得称赞的特性之一是它对异位焊接的适应性，这要归功于专门为该任务制作的电极。 熟练的焊工不仅取决于他们的实践技能，还取决于他们对设备的深入了解。这需要辨别机器的复杂性，包括所需极性的设置。例如，许多人可能会忽视这样一个事实：纯空调机器缺少极性开关——这个看似很小的细节却可以对焊接结果产生重大影响。此外，了解如何准确测量电流强度并辨别机器的工作周期（在给定时间内不发生过热的运行时间）至关重要。

source: The "Heat Affected Zone" (HAZ) in welding parlance refers to the region adjacent to the weld where the base metal has undergone changes in its microstructure and properties due to the heat of welding but hasn't melted. While this area doesn't melt during the welding process, it reaches temperatures high enough to induce metallurgical transformations. The HAZ is delineated by the boundary between the weld metal and the unaffected base metal. It's a critical region because its properties can vary from the base metal and the weld metal, and its behavior often determines the weld's overall performance. The characteristics of the HAZ are influenced by various factors, including the base metal's composition, the welding process, the amount of heat input, and the cooling rate. In some metals, particularly steels, the HAZ can experience hardening, which can make it more susceptible to cracking or reduced toughness. On the other hand, some metals might soften in the HAZ, compromising the joint's strength. The extent and nature of these changes are contingent on the specific thermal cycles the material undergoes during welding, dictating how fast it heats and cools. Understanding and managing the properties of the HAZ is essential for producing strong and durable welds. Welding procedures are often developed with the aim of minimizing the adverse effects in the HAZ, either by controlling the heat input or by subsequent heat treatments. Given its importance, the HAZ is a focal point in many welding inspections and assessments, as anomalies or defects in this zone can significantly impact the integrity and longevity of a welded joint.
es_419: La "zona afectada por el calor" (ZAT) en el lenguaje de soldadura se refiere a la región adyacente a la soldadura donde el metal base ha sufrido cambios en su microestructura y propiedades debido al calor de la soldadura, pero no se ha derretido. Si bien esta zona no se funde durante el proceso de soldadura, alcanza temperaturas lo suficientemente altas como para inducir transformaciones metalúrgicas. La HAZ está delimitada por el límite entre el metal de soldadura y el metal base no afectado. Es una región crítica porque sus propiedades pueden variar según el metal base y el metal de soldadura, y su comportamiento a menudo determina el rendimiento general de la soldadura. Las características de la ZAT están influenciadas por varios factores, incluida la composición del metal base, el proceso de soldadura, la cantidad de calor aportado y la velocidad de enfriamiento. En algunos metales, particularmente en los aceros, la ZAT puede endurecerse, lo que puede hacerla más susceptible a agrietarse o reducir su tenacidad. Por otro lado, algunos metales pueden ablandarse en la ZAT, comprometiendo la resistencia de la unión. El alcance y la naturaleza de estos cambios dependen de los ciclos térmicos específicos que sufre el material durante la soldadura, lo que determina la rapidez con la que se calienta y enfría. Comprender y gestionar las propiedades de la HAZ es esencial para producir soldaduras fuertes y duraderas. Los procedimientos de soldadura a menudo se desarrollan con el objetivo de minimizar los efectos adversos en la ZAT, ya sea controlando el aporte de calor o mediante tratamientos térmicos posteriores. Dada su importancia, la HAZ es un punto focal en muchas inspecciones y evaluaciones de soldadura, ya que las anomalías o defectos en esta zona pueden afectar significativamente la integridad y longevidad de una unión soldada.
fil_ph: Ang "Heat Affected Zone" (HAZ) sa welding parlance ay tumutukoy sa rehiyon na katabi ng weld kung saan ang base metal ay sumailalim sa mga pagbabago sa microstructure at mga katangian nito dahil sa init ng welding ngunit hindi pa natutunaw. Bagama't ang lugar na ito ay hindi natutunaw sa panahon ng proseso ng welding, umabot ito sa mga temperatura na sapat na mataas upang mahikayat ang mga pagbabagong metalurhiko. Ang HAZ ay delineated sa pamamagitan ng hangganan sa pagitan ng weld metal at ang hindi apektadong base metal. Ito ay isang kritikal na rehiyon dahil ang mga katangian nito ay maaaring mag-iba mula sa base metal at ang weld metal, at ang pag-uugali nito ay madalas na tumutukoy sa pangkalahatang pagganap ng weld. Ang mga katangian ng HAZ ay naiimpluwensyahan ng iba't ibang mga kadahilanan, kabilang ang komposisyon ng base metal, ang proseso ng hinang, ang dami ng input ng init, at ang rate ng paglamig. Sa ilang mga metal, partikular na sa mga bakal, ang HAZ ay maaaring makaranas ng hardening, na maaaring maging mas madaling kapitan sa pag-crack o pagbawas ng katigasan. Sa kabilang banda, maaaring lumambot ang ilang metal sa HAZ, na makompromiso ang lakas ng joint. Ang lawak at katangian ng mga pagbabagong ito ay nakasalalay sa mga partikular na thermal cycle na pinagdadaanan ng materyal sa panahon ng hinang, na nagdidikta kung gaano ito kabilis uminit at lumalamig. Ang pag-unawa at pamamahala sa mga katangian ng HAZ ay mahalaga para sa paggawa ng malakas at matibay na welds. Ang mga pamamaraan ng welding ay madalas na binuo na may layunin na mabawasan ang masamang epekto sa HAZ, alinman sa pamamagitan ng pagkontrol sa input ng init o sa pamamagitan ng mga kasunod na paggamot sa init. Dahil sa kahalagahan nito, ang HAZ ay isang focal point sa maraming welding inspections at assessments, dahil ang mga anomalya o depekto sa zone na ito ay maaaring makabuluhang makaapekto sa integridad at mahabang buhay ng isang welded joint.
ht: "Zòn ki afekte chalè" (HAZ) nan langaj soude refere a rejyon adjasan a soude kote metal debaz la te sibi chanjman nan mikrostruktur ak pwopriyete li yo akòz chalè soude men li pa fonn. Pandan ke zòn sa a pa fonn pandan pwosesis la soude, li rive nan tanperati ki wo ase yo pwovoke transfòmasyon métallurgique. HAZ a delimite pa fwontyè ki genyen ant metal la soude ak metal debaz ki pa afekte a. Li se yon rejyon kritik paske pwopriyete li yo ka varye de metal debaz la ak metal la soude, ak konpòtman li souvan detèmine pèfòmans jeneral soude a. Karakteristik HAZ a enfliyanse pa plizyè faktè, ki gen ladan konpozisyon metal debaz la, pwosesis la soude, kantite chalè D ', ak pousantaj la refwadisman. Nan kèk metal, patikilyèman asye, HAZ a ka fè eksperyans redi, sa ki ka fè li pi fasil pou fann oswa diminye severite. Nan lòt men an, kèk metal ka adousi nan HAZ la, konpwomèt fòs jwenti a. Kantite ak nati chanjman sa yo depann sou sik tèmik espesifik materyèl la sibi pandan soude, ki dikte konbyen vit li chofe ak refwadi. Konprann ak jere pwopriyete HAZ la esansyèl pou pwodui soude solid ak dirab. Pwosedi soude yo souvan devlope ak objektif pou minimize efè negatif nan HAZ la, swa pa kontwole D 'a chalè oswa pa tretman chalè ki vin apre. Bay enpòtans li, HAZ a se yon pwen fokal nan anpil enspeksyon soude ak evalyasyon, kòm anomali oswa domaj nan zòn sa a ka siyifikativman afekte entegrite a ak lonjevite nan yon jwenti soude.
pt_br: A "Zona Afetada pelo Calor" (HAZ) no jargão da soldagem refere-se à região adjacente à solda onde o metal base sofreu alterações em sua microestrutura e propriedades devido ao calor da soldagem, mas não derreteu. Embora esta área não derreta durante o processo de soldagem, ela atinge temperaturas altas o suficiente para induzir transformações metalúrgicas. A ZTA é delineada pela fronteira entre o metal de solda e o metal base não afetado. É uma região crítica porque suas propriedades podem variar entre o metal base e o metal de solda, e seu comportamento geralmente determina o desempenho geral da solda. As características da ZTA são influenciadas por vários fatores, incluindo a composição do metal base, o processo de soldagem, a quantidade de calor fornecido e a taxa de resfriamento. Em alguns metais, particularmente aços, a ZTA pode sofrer endurecimento, o que pode torná-la mais suscetível a trincas ou redução da tenacidade. Por outro lado, alguns metais podem amolecer na ZTA, comprometendo a resistência da junta. A extensão e a natureza destas mudanças dependem dos ciclos térmicos específicos pelos quais o material passa durante a soldagem, ditando a rapidez com que ele aquece e esfria. Compreender e gerenciar as propriedades da ZTA é essencial para produzir soldas fortes e duráveis. Os procedimentos de soldagem são frequentemente desenvolvidos com o objetivo de minimizar os efeitos adversos na ZTA, seja pelo controle da entrada de calor ou por tratamentos térmicos subsequentes. Dada a sua importância, a ZTA é um ponto focal em muitas inspeções e avaliações de soldagem, pois anomalias ou defeitos nesta zona podem impactar significativamente a integridade e longevidade de uma junta soldada.
zh_hans: 焊接用语中的“热影响区”(HAZ) 是指焊缝附近的区域，其中母材因焊接热量而发生微观结构和性能变化但尚未熔化。虽然该区域在焊接过程中不会熔化，但它的温度足以引发冶金转变。热影响区由焊缝金属和未受影响的母材之间的边界界定。它是一个关键区域，因为它的特性可能与母材金属和焊缝金属不同，而且它的行为通常决定焊缝的整体性能。 HAZ的特性受到多种因素的影响，包括母材的成分、焊接工艺、热输入量和冷却速率。在某些金属中，特别是钢材，热影响区可能会发生硬化，这会使其更容易出现裂纹或韧性降低。另一方面，某些金属可能会在热影响区软化，从而损害接头的强度。这些变化的程度和性质取决于材料在焊接过程中经历的特定热循环，决定了其加热和冷却的速度。 了解和管理热影响区的特性对于生产坚固耐用的焊缝至关重要。焊接工艺的制定通常旨在通过控制热输入或后续热处理来最大程度地减少热影响区的不利影响。鉴于其重要性，热影响区成为许多焊接检查和评估的焦点，因为该区域的异常或缺陷会显着影响焊接接头的完整性和寿命。
